/******************************** 头文件 *************************************/
#include "includes.hpp"

/****************************** 私有宏定义 ***********************************/

/******************************* 全局变量 ************************************/

/***************************** 私有全局变量 **********************************/


/******************************* 私有函数 ************************************/


/**
 * @brief  视频捕获
 * @param  无
 * @retval 状态码
 */
int video_capture(void)
{
	cv::VideoCapture cap(0);

	if (!cap.isOpened()) {
		cout << "open video failed" << endl;
		return -1;
	}

	for (;;) {
		Mat frame;

		cap >> frame;
		if (!frame.empty()) {
			imshow("frame", frame);
		}
		else {
			cout << "read frame failed" << endl;
		}

		/* 等待用户按键 */
		waitKey(30);
	}

	destroyAllWindows();

	return 0;
}

/*********************************END OF FILE*********************************/
